### Basic Properties of Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "Name":['smith','john','tom','micky','belly','fizz','ricky','happy'],
    "Age":[20,23,24,25,23,26,28,25],
    "Rating":[3.0,5.0,3.65,2.40,4.0,5.78,2.98,1.00]
}

df = pd.DataFrame(data)
df

    Name  Age  Rating
0  smith   20    3.00
1   john   23    5.00
2    tom   24    3.65
3  micky   25    2.40
4  belly   23    4.00
5   fizz   26    5.78
6  ricky   28    2.98
7  happy   25    1.00

In [3]:
# Transpose 
# rows to columns
# columns to rows
df.T

            0     1     2      3      4     5      6      7
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [4]:
df

    Name  Age  Rating
0  smith   20    3.00
1   john   23    5.00
2    tom   24    3.65
3  micky   25    2.40
4  belly   23    4.00
5   fizz   26    5.78
6  ricky   28    2.98
7  happy   25    1.00

In [5]:
# See it didn't make permanent changes 
# To make permanent changes store it in the variable 
t = df.T
t

            0     1     2      3      4     5      6      7
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [6]:
t

            0     1     2      3      4     5      6      7
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [7]:
t.head()

            0     1     2      3      4     5      6      7
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [8]:
t.index

Index(['Name', 'Age', 'Rating'], dtype='object')

In [9]:
t.columns

RangeIndex(start=0, stop=8, step=1)

In [10]:
t.head(2)

          0     1    2      3      4     5      6      7
Name  smith  john  tom  micky  belly  fizz  ricky  happy
Age      20    23   24     25     23    26     28     25

In [11]:
t.tail()

            0     1     2      3      4     5      6      7
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [12]:
df

    Name  Age  Rating
0  smith   20    3.00
1   john   23    5.00
2    tom   24    3.65
3  micky   25    2.40
4  belly   23    4.00
5   fizz   26    5.78
6  ricky   28    2.98
7  happy   25    1.00

In [13]:
df.axes
# Return a list representing the axes of the DataFrame.
# It has the row axis labels and column axis labels as the only members.
# They are returned in that order.

[RangeIndex(start=0, stop=8, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [14]:
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [15]:
df.ndim

2

In [16]:
df.shape

(8, 3)

In [17]:
df.value_counts()

Name   Age  Rating
belly  23   4.00      1
fizz   26   5.78      1
happy  25   1.00      1
john   23   5.00      1
micky  25   2.40      1
ricky  28   2.98      1
smith  20   3.00      1
tom    24   3.65      1
dtype: int64

In [18]:
df.values

array([['smith', 20, 3.0],
       ['john', 23, 5.0],
       ['tom', 24, 3.65],
       ['micky', 25, 2.4],
       ['belly', 23, 4.0],
       ['fizz', 26, 5.78],
       ['ricky', 28, 2.98],
       ['happy', 25, 1.0]], dtype=object)

In [19]:
df.tail()

    Name  Age  Rating
3  micky   25    2.40
4  belly   23    4.00
5   fizz   26    5.78
6  ricky   28    2.98
7  happy   25    1.00

In [20]:
df.sum()

Name      smithjohntommickybellyfizzrickyhappy
Age                                        194
Rating                                   27.81
dtype: object

In [21]:
df.Age.sum()

194

In [22]:
df['Age']

0    20
1    23
2    24
3    25
4    23
5    26
6    28
7    25
Name: Age, dtype: int64

In [23]:
df[['Age']]

   Age
0   20
1   23
2   24
3   25
4   23
5   26
6   28
7   25

In [24]:
df.loc[:,['Age']]

   Age
0   20
1   23
2   24
3   25
4   23
5   26
6   28
7   25

In [25]:
df[['Name','Age']]

    Name  Age
0  smith   20
1   john   23
2    tom   24
3  micky   25
4  belly   23
5   fizz   26
6  ricky   28
7  happy   25

In [26]:
df[['Age','Rating']]

   Age  Rating
0   20    3.00
1   23    5.00
2   24    3.65
3   25    2.40
4   23    4.00
5   26    5.78
6   28    2.98
7   25    1.00

In [27]:
df['Age'].sum()

194

In [28]:
df[['Age']].sum()

Age    194
dtype: int64

In [29]:
df['Age'].min()

20

In [30]:
df[['Age']].max()

Age    28
dtype: int64

In [31]:
df.describe()

            Age    Rating
count   8.00000  8.000000
mean   24.25000  3.476250
std     2.37547  1.497464
min    20.00000  1.000000
25%    23.00000  2.835000
50%    24.50000  3.325000
75%    25.25000  4.250000
max    28.00000  5.780000

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Rating  8 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 320.0+ bytes

In [33]:
df[['Age']].mean()

Age    24.25
dtype: float64

In [37]:
df[['Age','Rating']].mean()

Age       24.25000
Rating     3.47625
dtype: float64

In [39]:
df[['Age','Rating']].median()

Age       24.500
Rating     3.325
dtype: float64

In [38]:
df[['Age','Rating']].agg['sum','mean','min']

TypeError: 'method' object is not subscriptable